bonaventureli/ble_services/nRF5_SDK_15.2.0_9412b96/examples/ble_peripheral/ble_app_hrs_sdk/main.c
    UNUSED_PARAMETER(p_context);

    sensor_contact_detected = !sensor_contact_detected;
    ble_hrs_sensor_contact_detected_update(&m_hrs, sensor_contact_detected);
}
#endif

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    ret_code_t err_code;

    // Initialize timer module.
    err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    // Create timers.
	#if 1
    err_code = app_timer_create(&m_battery_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                battery_level_meas_timeout_handler);
    APP_ERROR_CHECK(err_code);
	#endif

    err_code = app_timer_create(&m_heart_rate_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                heart_rate_meas_timeout_handler);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&m_rr_interval_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                rr_interval_timeout_handler);
    APP_ERROR_CHECK(err_code);
#if 1
    err_code = app_timer_create(&m_sensor_contact_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                sensor_contact_detected_timeout_handler);
    APP_ERROR_CHECK(err_code);
#endif
}


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    ret_code_t              err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_HEART_RATE_SENSOR_HEART_RATE_BELT);
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief GATT module event handler.
 */
static void gatt_evt_handler(nrf_ble_gatt_t * p_gatt, nrf_ble_gatt_evt_t const * p_evt)
{
    if (p_evt->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED)
    {
        NRF_LOG_INFO("GATT ATT MTU on connection 0x%x changed to %d.",
                     p_evt->conn_handle,
                     p_evt->params.att_mtu_effective);
    }

    ble_hrs_on_gatt_evt(&m_hrs, p_evt);
}


/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


uint8_t ble_set_info(ble_hrs_t * p_hrs, uint8_t * data, uint16_t length)
{
    ret_code_t         err_code = NRF_SUCCESS;
	  ble_gatts_value_t  gatts_value;
        // Initialize value struct.
        memset(&gatts_value, 0, sizeof(gatts_value));

        gatts_value.len     = length;
        gatts_value.offset  = 0;
        gatts_value.p_value = data;

	NRF_LOG_DEBUG("This is ble_set_info function\n");
        // Update database.
        err_code = sd_ble_gatts_value_set(BLE_CONN_HANDLE_INVALID,
                                          p_hrs->info_handles.value_handle,
                                          &gatts_value);
        if (err_code == NRF_SUCCESS)
        {
            //NRF_LOG_INFO("Battery level has been updated: %d%%", battery_level)

            // Save new battery value.
            //p_bas->battery_level_last = battery_level;
        }
        else
        {
            NRF_LOG_DEBUG("Error ikble_set_se_info: 0x%08X", err_code)

            return err_code;
        }
	
	  return 0;
}

uint32_t ikble_set_se_info(uint8_t * data, uint16_t length)
{
      ble_set_info(&m_hrs, data, length);
      return 1;
}

void Handle_info(uint8_t *data, uint32_t data_len)
{
	unsigned int outlen;
	uint8_t *preply_data;
	uint8_t tmpdata[150];
	uint32_t ret;
	preply_data = tmpdata;
	uint8_t status;
	uint8_t i=20;
	#if 0
	NRF_LOG_INFO("\nHandle_info_function:[Before] ingeek_push_info:status:ingeek_get_sec_status is %x.if 0xFF, it is right\n",ingeek_get_sec_status());
	#endif
	
	#if 1
	//while(i--);
	//NRF_LOG_HEXDUMP_INFO(data, data_len);
	//NRF_LOG_INFO("\n ========================Start:ingeek_push_info function=====================\n \n");
	if(ingeek_push_info(data, data_len) == 0){
	NRF_LOG_INFO("\n push info success! \n");
	//NRF_LOG_INFO("\n ========================End:ingeek_push_info function=======================\n \n");
	}
	#endif
	
		#if 0
		uint8_t ActiveData[72]={
0x08,0xE2,0x0F,0x12,0x11,0x4B,0x4D,0x4C,0x38,0x46,0x30,0x30,0x39,0x31,0x43,0x43,0x32,0x34,0x46,0x44,0x41,0x31,0x1A,0x30,\
0x4F,0x2E,0x1C,0xE9,0x99,0x6F,0xE5,0x09,0x42,0x9C,0x92,0x3F,0x67,0xEB,0xC4,0xAF,0x16,0x37,0x09,0x9A,0xEF,0x1B,0xEC,0xA5,\
0xCE,0x69,0x4C,0xD6,0xE2,0xBC,0x47,0x0C,0xE2,0x3A,0x17,0x5D,0x6E,0x61,0x16,0xE7,0xF1,0x45,0x51,0x19,0x60,0xE2,0x44,0xD4,
		};
	int ActiveData_len =72;
	if(ingeek_push_info(ActiveData, ActiveData_len) == 0){
	NRF_LOG_INFO("\n push info success! \n");
	
	}
	#endif
	
	#if 0
	NRF_LOG_INFO("\nreturn:ingeek_push_info(data, data_len) status is %x.if 0,it is right\n",ingeek_push_info(data, data_len));
	#endif

