bonaventureli/ble_services/nRF5_SDK_15.2.0_9412b96/examples/ble_peripheral/ble_app_hrs_sdk/main.c
	#if 0
	NRF_LOG_INFO("\nHandle_info_function:[After] ingeek_push_info:status:ingeek_get_sec_status is %x.if 0,it is right\n",ingeek_get_sec_status());
	#endif 
	
	#if 1
	status = ingeek_get_sec_status();
	ble_send_notify(BLE_UUID_DIGITALKET_STATUS_CHAR, &status, 1);
  if(status == 0){
	gActive = 1;
	NRF_LOG_INFO("gActive is ok! \n");
	}
	#endif
	
	#if 0
	NRF_LOG_INFO("\nreturn:ingeek_pull_info(preply_data, &outlen) status is %x.if 0,it is right\n",ingeek_pull_info(preply_data, &outlen));
	#endif
	
	#if 1
	if(ingeek_pull_info(preply_data, &outlen) == 0){
	//NRF_LOG_INFO("\n pull info error \n");
		NRF_LOG_INFO("\n pull info success! \n");
		memcpy(gReturnInfo,preply_data,outlen);
	  gReturnInfoLen = outlen;
	}
	#endif
	
	#if 0
	NRF_LOG_INFO("\nHandle_info_function:[After] ingeek_pull_info:status:ingeek_get_sec_status is %x.if 1,it is right\n",ingeek_get_sec_status());
	#endif
	
	#if 0
	//ikble_set_se_info(preply_data, outlen);
	//NRF_LOG_HEXDUMP_INFO(preply_data, outlen);
	NRF_LOG_HEXDUMP_INFO(gReturnInfo, gReturnInfoLen);
	//ble_send_notify(BLE_UUID_DIGITALKET_SESSION_CHAR, gReturnInfo, gReturnInfoLen);
	#endif
	
	#if 0
	//status = 0;//1;//ingeek_get_sec_status();
	ble_send_notify(BLE_UUID_DIGITALKET_STATUS_CHAR, &status, 1);
	#endif
	
	if (gActive == 1){
			//ble_send_notify(BLE_UUID_DIGITALKET_SESSION_CHAR, gReturnInfo, gReturnInfoLen);
		  //NRF_LOG_HEXDUMP_INFO(gReturnInfo, gReturnInfoLen);
				//gActive = 0;
			}
}
void Handle_auth(uint8_t *data, uint32_t data_len)
{
	uint8_t status;
	
	#if 0
	NRF_LOG_INFO("\nHandle_auth_function:[Before] ingeek_push_auth:status:ingeek_get_sec_status is %x. if 1,it is right\n",ingeek_get_sec_status());
	NRF_LOG_INFO("\nHandle_auth_function,return:ingeek_push_auth %x, if 0,it is right\n",ingeek_push_auth(data, data_len, (unsigned char*)1, (unsigned int*)1));
	NRF_LOG_INFO("\nHandle_auth_function:[After] ingeek_push_auth:status:ingeek_get_sec_status is %x. if 2,it is right\n",ingeek_get_sec_status());
	#endif
	NRF_LOG_HEXDUMP_INFO(data, data_len);
	ingeek_push_auth(data, data_len, (unsigned char*)1, (unsigned int*)1);
	
	status = ingeek_get_sec_status();
	ble_send_notify(BLE_UUID_DIGITALKET_STATUS_CHAR, &status, 1);
}

void Handle_session(uint8_t *data, uint32_t data_len)
{
	//T_UartSendSession FramedataSession;
	unsigned int outlen;
	uint8_t *preply_data;
	uint8_t status;
	//preply_data = gDataload;
	#if 0
	NRF_LOG_INFO("\nHandle_session_function:[Before] ingeek_push_auth:status:ingeek_get_sec_status is %x. if 2,it is right\n",ingeek_get_sec_status());
	NRF_LOG_INFO("\nHandle_session_function,return:ingeek_push_auth %x, if 0,it is right\n",ingeek_push_session(data, data_len, preply_data, &outlen));
	NRF_LOG_INFO("\nHandle_session_function:[After] ingeek_push_auth:status:ingeek_get_sec_status is %x. if 3,it is right\n",ingeek_get_sec_status());
	
	NRF_LOG_INFO("\nHandle_session is ok ,ingeek_push_session,preply_data:\n");
	#endif
	
	ingeek_push_session(data, data_len, preply_data, &outlen);
	NRF_LOG_HEXDUMP_INFO(preply_data, outlen);
	ble_send_notify(BLE_UUID_DIGITALKET_SESSION_CHAR, preply_data, outlen);
	ble_send_notify(BLE_UUID_DIGITALKET_STATUS_CHAR, &status, 1);
}
	 
void Handle_cmd(uint8_t *data, uint32_t data_len)
{
//	T_UartSendCmd FramedataCmd;
	uint8_t *preply_data;
	unsigned int outlen;
	

	DK_Cmd_Meg struct_cmd;
	uint8_t cmd;

//	preply_data = gDataload;
	#if 0
	NRF_LOG_INFO("\nHandle_cmd_function:[Before] ingeek_command_input_action:status:ingeek_get_sec_status is %x. if 3,it is right\n",ingeek_get_sec_status());
	NRF_LOG_INFO("\nHandle_cmd_function,return:ingeek_command_input_action %x, if 0,it is right\n",ingeek_command_input_action(data, data_len, &struct_cmd));
	NRF_LOG_INFO("\nHandle_cmd_function:[After] ingeek_command_input_action:status:ingeek_get_sec_status is %x. if 3,it is right\n",ingeek_get_sec_status());
	NRF_LOG_INFO("\nHandle_cmd_function: %x \n",(uint8_t)(struct_cmd.command));
	#endif
	ingeek_command_input_action(data, data_len, &struct_cmd);
	
	#if 0
	NRF_LOG_INFO("\nHandle_cmd_function,return:ingeek_command_output_action %x, if 0,it is right\n",ingeek_command_output_action(&struct_cmd,preply_data, &outlen));
	NRF_LOG_INFO("\nHandle_cmd is ok ,ingeek_command_input_action,preply_data:\n");
	#endif
	
	ingeek_command_output_action(&struct_cmd,preply_data, &outlen);
	//NRF_LOG_HEXDUMP_INFO(preply_data, outlen);
	NRF_LOG_HEXDUMP_INFO(preply_data, outlen);
	ble_send_notify(BLE_UUID_DIGITALKET_CMD_CHAR, preply_data, outlen);

}
#define SESSIONMAXBIT 112
#define INFOCHARMAXBIT 29
#define DK_REPLAY_MAXBIT 128
void ble_hrs_evt_handler (ble_hrs_t * p_hrs, ble_hrs_evt_t * p_evt){

	uint8_t status = 0;
	
	switch(p_evt->evt_type)
	{
		case BLE_HRS_EVT_NOTIFICATION_ENABLED:
		{
			NRF_LOG_INFO("BLE_EVT_NOTIFICATION_ENABLED");
			if (gActive == 1){
			//ble_send_notify(BLE_UUID_DIGITALKET_SESSION_CHAR, gReturnInfo, gReturnInfoLen);
		  //NRF_LOG_HEXDUMP_INFO(gReturnInfo, gReturnInfoLen);
				//gActive = 0;
			}
			break;
		}
		case BLE_HRS_EVT_NOTIFICATION_DISABLED:
		{
			NRF_LOG_INFO("BLE_EVT_NOTIFICATION_DISABLED");
				if(status == 1){
	gActive = 1;
		NRF_LOG_INFO("\n gActive is ok!\n");
	}
			break;
		}
		case BLE_DIGITAKKEY_EVT_INFO:
		{
			//NRF_LOG_INFO("This is BLE_DIGITAKKEY_EVT_INFO function add lifei 2018/11/2 17:52.");
			//NRF_LOG_HEXDUMP_INFO((uint8_t *)p_evt->params.rx_data.p_data, (uint16_t)p_evt->params.rx_data.length);	
			#if 0
			Handle_info((uint8_t *)p_evt->params.rx_data.p_data, (uint32_t) p_evt->params.rx_data.length);
			#endif
			//ikcmdSendUart(*p_evt->params.rx_data.p_data);
			break;
		}
		case BLE_DIGITAKKEY_EVT_AUTH:
		{
			//NRF_LOG_INFO("This is BLE_DIGITAKKEY_EVT_AUTH function add lifei 2018/11/2 17:52.");
			//NRF_LOG_HEXDUMP_INFO((uint8_t *)p_evt->params.rx_data.p_data, (uint16_t)p_evt->params.rx_data.length);	
			Handle_auth((uint8_t *)p_evt->params.rx_data.p_data, (uint32_t) p_evt->params.rx_data.length);
			break;
		}
		case BLE_DIGITAKKEY_EVT_SESSION:
		{
			//NRF_LOG_INFO("This is BLE_DIGITAKKEY_EVT_SESSION function add lifei 2018/11/2 17:52.");
			//NRF_LOG_HEXDUMP_INFO((uint8_t *)p_evt->params.rx_data.p_data, (uint16_t)p_evt->params.rx_data.length);	
			Handle_session((uint8_t *)p_evt->params.rx_data.p_data, (uint32_t) p_evt->params.rx_data.length);
			break;
		}
		case BLE_DIGITAKKEY_EVT_CMD:
		{
			Handle_cmd((uint8_t *)p_evt->params.rx_data.p_data, (uint32_t) p_evt->params.rx_data.length);
			NRF_LOG_HEXDUMP_INFO((uint8_t *)p_evt->params.rx_data.p_data, (uint16_t)p_evt->params.rx_data.length);	
			NRF_LOG_INFO("This is BLE_DIGITAKKEY_EVT_CMD function add lifei 2018/11/2 17:52.");
			
			
			break;
		}
		
