bonaventureli/ble_services/nRF5_SDK_15.2.0_9412b96/examples/ble_peripheral/ble_app_hrs_sdk/main.c
static int storageReadData(uint8_t *outBuf, uint32_t word_count, uint32_t offset)
{
    uint32_t err_code;
    if (NULL == outBuf)
        return 0;

    if ((offset >= 1024) || (word_count + offset > 1024))
        return 0;
        
    err_code = fstorage_data_read(offset, outBuf, word_count);
    if (NRF_SUCCESS != err_code)
    {
        return 0;
    }

    return 0;
}

static int storageWriteData(const uint8_t *inBuf, uint32_t word_count,uint32_t offset)
{
    uint32_t err_code;
    
    if (NULL == inBuf)
        return 0;

    if ((offset >= 1024) || (word_count + offset > 1024))
        return 0;
        
    err_code = fstorage_data_write(offset, inBuf, word_count);
    if (NRF_SUCCESS != err_code)
    {
        return 0;
    }

    return 0;
}
#endif

#if 0
static int ikif_uart_txcb( const uint8_t *msg, uint32_t wlen, uint32_t offset )
{
    int ret;
    //NRF_LOG_INFO("ikif_uart_txcb tx %d bytes", wlen);
    
    ret = m2m_if_UartSendData((uint8_t *)msg, (uint16_t)wlen);
    if (wlen != ret)
    {
        NRF_LOG_WARNING("m2m_if_UartSendData send Failed, req=%d, sended=%d", wlen, ret);
    }
    
    return ret;
}
#endif
/**@brief Function for application main entry.
 */
int main(void)
{
    bool erase_bonds;

    // Initialize.
		
	
    log_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    advertising_init();
    services_init();
    //sensor_simulator_init();
    conn_params_init();
	
    peer_manager_init();

    // Start execution.
    NRF_LOG_INFO("started %s",DEVICE_NAME);
    application_timers_start();
    advertising_start(erase_bonds);
		
//		// Add fstorage data
//    (void)fstorage_data_init();
//		// Add ingeek function
//    g_ios.flashRCallback = storageReadData;
//    g_ios.flashWCallback = storageWriteData;
//    //g_ios.uartTxCallback = ikif_uart_txcb;
//    DKCreateSRV(&g_ios);
		//NRF_LOG_INFO("\n ========================Start:ingeek_set_callback function=====================\n \n");
		ingeek_set_callback(read_CB1,write_CB1,Rand_CB1);
		//NRF_LOG_INFO("\n ========================End:ingeek_set_callback function=======================\n \n");
		//ingeek_set_callback(read_CB1,write_CB1,ikif_random_vector_generate);
		
		
		//NRF_LOG_INFO("main:return-ingeek_se_init is %x.",ingeek_se_init());
		//NRF_LOG_INFO("\n ========================Start:ingeek_se_init function=====================\n \n");
		ingeek_se_init();
		//NRF_LOG_INFO("\n ========================End:ingeek_se_init function=======================\n \n");
		
		NRF_LOG_INFO("main:return-ingeek_get_sec_status is %x.",ingeek_get_sec_status());

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}


